# Написать программу вычисления значения функции y = f(a)
print('Введите а = ')
a = float(input())

y = a + (32 / 4)
print(y)