# Дано число. Проверить кратно ли оно 7 и 23
print('Введите число:')
a = int(input())

if a % 7 == 0:
    print('Кратно 7')
else:
    print('Не кратно 7')
if a % 23 == 0:
    print('Кратно 23')
else:
    print('Не кратно 23')