# Определить номер четверти плоскости, 
# в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
print('Введите координату X:')
X = float(input())
print('Введите координату Y:')
Y = float(input())
if X > 0 and Y > 0:
    print('1 четверть')
if X < 0 and Y > 0:
    print('2 четверть')
if X < 0 and Y < 0:
    print('3 четверть')
if X > 0 and Y < 0:
    print('4 четверть')