# Даны два числа. Показать большее и меньшее число
a = 30
b = 12

if a < b:
    print('max =', b, 'min =', a)
else:
    print('max =', a, 'min =', b)